[
  {
    "name": "Taylor Adams",
    "school": "Jackson",
    "position": "Inf",
    "sport": "Softball",
    "year": "Sr.",
    "blurb": "A four-year starter at first base with multiple awards, Adams led the Timberwolves to the Class 4A Northwest District tournament by batting .542 with 30 RBI and 26 runs. She popped 13 extra-base hits (.946 slugging percentage) and has signed with San Diego State.",
    "image": "tayloradams.JPG"
  },
  {
    "name": "Taylor Anderson",
    "school": "Tahoma",
    "position": "OF",
    "sport": "Softball",
    "year": "Sr. ",
    "blurb": "The Bears won the NPSL Cascade Division in large part because of Anderson, who was the division’s top hitter with a .625 average. She recorded 105 putouts without making an error and hopes to lead Tahoma back to state. Signed with North Idaho College.",
    "image": "tayloranderson.JPG"
  },
  {
    "name": "Michael Attalah",
    "school": "Cedar Park Christian",
    "position": "Utl",
    "sport": "Baseball",
    "year": "Sr. ",
    "blurb": "Headed to Oregon State, Attalah was solid on the mound and at the plate for the Class 1A bi-district champs. He batted .450 with 12 RBI and had an ERA of 1.92, striking out 63 in 36.3 innings pitched.",
    "image": "michaelattah.JPG"
  },
  {
    "name": "Isaac Barrera",
    "school": "Kentridge",
    "position": "OF",
    "sport": "Baseball",
    "year": "Sr.",
    "blurb": "Hit .500 for the Chargers at leadoff. Barrera had 11 RBI  and scored 21 runs. He’ll play for Bellevue College next year.",
    "image": "isaacbarrera.JPG"
  },
  {
    "name": "Habib Barry",
    "school": "Tyee",
    "position": "F",
    "sport": "Soccer",
    "year": "Sr. ",
    "blurb": "Barry, a U.S. U-19 national team member and Seattle Sounders FC Academy player, piled up 34 goals and eight assists as the Totems  won SPSL 2A with a 13-1-0 record. Barry shredded opposing defenses and helped Tyee back to state for the first time since 2015.",
    "image": "habibbarry.JPG"
  },
  {
    "name": "Michael Bartley",
    "school": "Archbishop Murphy",
    "position": "Coach",
    "sport": "Soccer",
    "blurb": "The Wildcats’ sixth-year coach, who also directs the girls program, has pushed the boys within two wins of capturing a third consecutive Class 2A state title this season. This season’s 20-0-0 has outscored teams 96-5. Bartley’s team went 12-0-0 to capture the Cascade Conference this spring for the fourth season in a row. His career record with the program is 116-10-3 in six seasons.",
    "image": "michaelbartley.JPG"
  },
  {
    "name": "Tori Bivens",
    "school": "Lake Washington",
    "position": "OF",
    "sport": "Softball",
    "year": "Sr.",
    "blurb": "Bivens, a Boise State signee who also pitches and plays first base, is tearing it up again at the plate, posting a .722 batting average through the regular season (and a 1.259 slugging percentage) with 34 runs scored and 34 RBI. She was 8-2 on the mound with a 1.596 ERA. Earned KingCo 3A/2A MVP last year, when was the Star Times choice as a utility player.",
    "image": "toribivens.JPG"
  },
  {
    "name": "Zoe Collins",
    "school": "Auburn Mountainview",
    "position": "P",
    "sport": "Softball",
    "year": "Sr.",
    "blurb": "After leading the Lions to the Class 3A state tournament last season, Collins didn’t miss a beat stepping up to Class 4A, keying their run to the NPSL Olympic Division crown, batting a team-best .558 with a division-leading 25 runs scored. She was 11-1 on the mound with a 1.77 ERA and 102 Ks in 75 innings.",
    "image": "zoecollins.JPG"
  },
  {
    "name": "Marcos Cuenca",
    "school": "Rainier Beach",
    "position": "P",
    "sport": "Baseball",
    "year": "Sr.",
    "blurb": "Cuenca helped the Vikings to their best season in decades. He had a 1.55 ERA, giving up 17 hits while striking out 101 batters in 52.2 innings.",
    "image": "marcoscuenca.JPG"
  },
  {
    "name": "Ivan Esmeral",
    "school": "Skyline",
    "position": "D",
    "sport": "Soccer",
    "year": "Sr.",
    "blurb": "The Spartans’ team captain was instrumental in the program winning the KingCo 4A regular-season title and making its eighth consecutive trip  to the Class 4A state tournament. Esmeral, the club’s center back, was named Defensive Most Valuable Player in KingCo 4A as the Spartans limited teams to just eight goals. ",
    "image": "ivanesmeral.JPG"
  },
  {
    "name": "Jason Fairhurst",
    "school": "Snohomish",
    "position": "F",
    "sport": "Soccer",
    "year": "Sr. ",
    "blurb": "The four-year letterwinner put up 14 goals and 11 assists and was a big reason the Panthers won the Wesco 3A regular-season crown with an 11-1-0 mark, the school’s fourth crown in Fairhurst’s four seasons. The captain and St. Martin’s University commit, who has a 3.88 GPA, has won two state titles in the program and is seeking another this spring. He has 46 goals and 45 assists in his career.",
    "image": "jasonfairhurst.JPG"
  },
  {
    "name": "Jesse Franklin",
    "school": "Seattle Prep",
    "position": "OF",
    "sport": "Baseball",
    "year": "Sr.",
    "blurb": "The Michigan commit batted .557 with four homers, striking out only twice. Franklin, who was a Star Times pick in 2015, also had 23 RBI and 11 stolen bases on 11 attempts.",
    "image": "jessefranklin.JPG"
  },
  {
    "name": "Luke Gregg",
    "school": "Todd Beamer",
    "position": "D",
    "sport": "Soccer",
    "year": "Sr.",
    "blurb": "A four-year starter for the Titans, Gregg played a prominent role as center back on a defense that limited teams to just 11 goals in 17 matches. The Titans’ captain was key in the program qualifying for Class 4A state for the first time since 2011 with his large presence at the back. Beamer won the NPSL 4A Olympic Division, thanks to defense. Gregg will play at Pierce College next fall.",
    "image": "lukegregg.JPG"
  },
  {
    "name": "Emma Helm",
    "school": "Meadowdale",
    "position": "C",
    "sport": "Softball",
    "year": "Sr.",
    "blurb": "The Washington-bound Helm, who was the catalyst to last year’s ride to the Class 3A state championship, is a four-year starter and two-time Star Times selection behind the plate. Plus she is batting .557 with 19 RBIs.",
    "image": "emmahelm.JPG"
  },
  {
    "name": "Nicholas Hovland",
    "school": "Highline",
    "position": "Inf",
    "sport": "Baseball",
    "year": "Jr.",
    "blurb": "The Pirates won their first South Puget Sound League title behind Hovland batting .512 with two home runs. He accounted for 24 RBI and had no errors in 55 chances on defense.",
    "image": "nicholashovland.JPG"
  },
  {
    "name": "Noah Hsue",
    "school": "Mercer Island",
    "position": "Inf",
    "sport": "Baseball",
    "year": "Sr.",
    "blurb": "The Washington commit helped the Islanders advance to the state tournament for the third straight year. Batted .431 with nine RBI and striking out just once.",
    "image": "noahhsue.JPG"
  },
  {
    "name": "Nick Hull",
    "school": "Edmonds-Woodway",
    "position": "P",
    "sport": "Baseball",
    "year": "Sr.",
    "blurb": "Led the Warriors to the Class 3A Northwest District title with a 1.81 ERA. Hull pitched 54 innings, striking out 81 batters. He will play at Grand Canyon next year.",
    "image": "nickhull.JPG"
  },
  {
    "name": "Sara Johnson",
    "school": "Lake Stevens",
    "position": "P",
    "sport": "Softball",
    "year": "Jr. ",
    "blurb": "Johnson, who has committed to play for Towson (Md.), led the Vikings to the Wesco 4A title at 13-1. She headed into postseason play with an overall record of 15-1 with a 1.03 ERA with 144 strikeouts and a batting average of .497.",
    "image": "sarajohnson.JPG"
  },
  {
    "name": "Lou Kennedy",
    "school": "Snohomish",
    "position": "Coach",
    "sport": "Softball",
    "blurb": "Kennedy is in his 13th season as coach at Snohomish and is approaching 200 victories. He stands at 196-106 as the Panthers cruise into state at 21-2. He guided them to their first state championship last year, coming at the Class 4A level, and this season they have a shot at the Class 3A title. They went 18-0 in the WesCo 3A North.",
    "image": "loukennedy.JPG"
  },
  {
    "name": "Maddie Loverich",
    "school": "Bainbridge",
    "position": "Inf",
    "sport": "Softball",
    "year": "Jr. ",
    "blurb": "Loverich, who primarily catches but also plays third base, batted .542 with 13 extra-base hits (a .983 slugging percentage) and 28 RBI as the Spartans finished the regular season at 17-3 and just missed the Metro League Mountain Division title. Her career batting average is .426.",
    "image": "maddieloverich.JPG"
  },
  {
    "name": "Kyler McMahan",
    "school": "Lynnwood",
    "position": "Inf",
    "sport": "Baseball",
    "year": "Sr.",
    "blurb": " McMahan was dependable as he batted .479 in 71 at-bats. The Oregon State commit had 21 RBI.",
    "image": "kylermcmahan.JPG"
  },
  {
    "name": "Lucas Meek",
    "school": "Mercer Island",
    "position": "MF",
    "sport": "Soccer",
    "year": "Sr.",
    "blurb": "The University of Washington commit pushed the Islanders to their third consecutive KingCo 3A regular-season championship, propelling his team with 19 goals and three assists. Meek, who owns a 3.77 GPA, was named KingCo 3A/2A Most Valuable Player.",
    "image": "lucasmeek.JPG"
  },
  {
    "name": "Kiki Milloy",
    "school": "Redmond",
    "position": "OF",
    "sport": "Softball",
    "year": "So.",
    "blurb": "The only sophomore on this year’s Star Times team, Milloy showed plenty of savvy in helping the Mustangs earn a share of the KingCo 3A/2A title. They finished the regular season at 16-4 as she batted .649 with 36 runs scored and 35 RBI in the leadoff position. She bashed 18 extra-base hits (including nine HRs) and was 22-for-22 on stolen bases.",
    "image": "kikimilloy.JPG"
  },
  {
    "name": "Maddie Morgan",
    "school": "Lynnwood",
    "position": "Inf",
    "sport": "Softball",
    "year": "Sr. ",
    "blurb": "Morgan returns to the Star Times team for the third consecutive season after putting up eye-popping numbers at the plate — a .712 batting average with 23 extra-base hits, 22 runs scored and 20 RBI (plus 13 walks). Her four-year career average hovers around .650, showing why she committed to Alabama as a freshman.",
    "image": "maddiemorgan.JPG"
  },
  {
    "name": "Ryan Ober",
    "school": "Glacier Peak",
    "position": "Inf",
    "sport": "Baseball",
    "year": "Sr.",
    "blurb": "In 16 games, Ober batted .408 with 18 RBI and 14 runs scored. The Oregon State commit helped the Grizzlies win a piece of the Wesco 4A regular-season title.",
    "image": "ryanober.JPG"
  },
  {
    "name": "Ethan Smith",
    "school": "Glacier Peak",
    "position": "OF",
    "sport": "Baseball",
    "year": "Sr.",
    "blurb": "Batting leadoff, Smith had a .482 average for the Grizzlies. He also tallied 11 RBI and 25 runs scored and will play for Bellevue College next year. ",
    "image": "ethansmith.JPG"
  },
  {
    "name": "Lucas Richardson",
    "school": "Skyline",
    "position": "GK",
    "sport": "Soccer",
    "year": "Jr.",
    "blurb": "Richardson was a menacing presence on the Spartans’ back line, teaming with Kenneth Symmes for 11 shutouts this spring. One opposing KingCo 4A coach said: “Lucas is a presence in goal with his tremendous wing span and discipline in front of the net. He makes good decisions and is very technical, making it very difficult to be scored on.”",
    "image": "lucasrichardson.JPG"
  },
  {
    "name": "Lauryn Rhinehart",
    "school": "Woodinville",
    "position": "Utl",
    "sport": "Softball",
    "year": "Sr. ",
    "blurb": "The nationally ranked Falcons have a bevy of talented players, but Rhinehart has been the standout as they won the KingCo 4A title. Through 18 games, she batted .517 with just one strikeout in 60 at-bats, pitching and playing at shortstop and in the outfield as needed. She was 8-0 on the mound at that point with 71 strikeouts in 44 innings and a 1.27 ERA. ",
    "image": "laurynrhinehart.JPG"
  },
  {
    "name": "Diego Rios",
    "school": "Archbishop Murphy",
    "position": "D",
    "sport": "Soccer",
    "year": "Sr. ",
    "blurb": "The talented wingback helped the Wildcats limit opponents to just four goals in 2017 and he found time to get free for seven goals and 12 assists this season. He factored heavily into the team’s 14 shutouts and will continue playing at Azusa Pacific University, a NCAA Division II school in California. ",
    "image": "diegorios.JPG"
  },
  {
    "name": "Eamon Stein",
    "school": "The Bush School",
    "position": "MF",
    "sport": "Soccer",
    "year": "Sr. ",
    "blurb": "The Emerald City League MVP was a marked man, but he still managed 14 goals and 12 assists to lead the school to its first ECL crown. The three-time ECL first-team selection also keyed the Blazers’ run to their first bi-district tournament title and will take his 3.97 GPA to study and play at Pomona College, an NCAA Division III school in Claremont, Calif.",
    "image": "eamonstein.JPG"
  },
  {
    "name": "Borislav Stoyanov",
    "school": "Mountlake Terrace",
    "position": "F",
    "sport": "Soccer",
    "year": "Jr.",
    "blurb": "With 22 goals and 10 assists, the Hawks’ top scorer led the school to back-to-back state berths for the first time in 25 years. Stoyanov, who owns a 3.7 GPA and tied a school record with six goals in a game this season, is mulling playing collegiately at Syracuse, UCLA, Notre Dame and the University of Washington.",
    "image": "borislav.JPG"
  },
  {
    "name": "Johnny Swann",
    "school": "O'Dea",
    "position": "MF",
    "sport": "Soccer",
    "year": "Sr.",
    "blurb": "The Ohio State University commit supplied six goals and five assists to lead the Irish to the second-best, regular-season record in Metro League play at 10-2-3.  Swann can play anywhere in the Irish midfield and coach Kevin Fieser “sets up the play that leads to a goal and he probably has 10 assists to the assist.”",
    "image": "johnswann.JPG"
  },
  {
    "name": "Gabe Togia",
    "school": "Federal Way",
    "position": "C",
    "sport": "Baseball",
    "year": "Sr. ",
    "blurb": "The Gonzaga commit threw out eight base stealers as the Eagles won the North Puget Sound League title. Togia batted .320 with 12 RBI and 15 runs. ",
    "image": "gabetogia.JPG"
  },
  {
    "name": "Rylie Wales",
    "school": "Snohomish",
    "position": "Inf",
    "sport": "Softball",
    "year": "Sr. ",
    "blurb": "Wales, Western Washington signee, helped take the Panthers to their first Class 4A state championship last season. The Panthers are a  Class 3A contender after going 8-0 in the WesCo 3A North. She hit for the cycle in her final regular-season game, capped by a grand slam, raising her average to .615 and slugging percentage to 1.138 with 39 RBI.",
    "image": "ryliewales.JPG"
  },
  {
    "name": "Matt Williams",
    "school": "Archbishop Murphy",
    "position": "F",
    "sport": "Soccer",
    "year": "Sr.",
    "blurb": "Williams just has knack for finding the back of the net and added 28 goals and 13 assists in 2017 as the Wildcats  extended their Cascade Conference win streak to 42 matches and took home the Class 2A Northwest/Sea-King bi-district championship. The future Washington State University student won’t play soccer in college.",
    "image": "mattwilliams.JPG"
  },
  {
    "name": "Dominic Woody",
    "school": "Mercer Island",
    "position": "Coach",
    "sport": "Baseball",
    "year": " ",
    "blurb": "Former University of Washington catcher led the Islanders to back-to-back KingCo regular season titles and the KingCo 3A district championship. Woody has a career record of 86-34 in five seasons at Mercer Island.",
    "image": "dominicwoody.JPG"
  }
]